app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (title LIKE '%%' OR description LIKE '%%' OR area LIKE '%%' OR genre LIKE '%%' )
---
  def index

  #@search = Event.search(params[:search])
 # @events = @search.all
 @events = Event.near('Paris, France', 20)


  @events = Event.search(params[:search])

SELECT "events".* FROM "events" WHERE "events"."id" = ? LIMIT 1  [["id", "980190962"]]
---
   def find_closest
	@userLocation = MultiGeocoder.geocode(params[:userLocation])
	if @userLocation.success
	@events = Event.find(:all,
		:origin => [@userLocation.lat, @userLocation.lng],
		:conditions => ["distance < 0.5", params[:radius]],
		:order=>'distance')

INSERT INTO "events" ("created_at", "date", "description", "genre", "location", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @event = Event.new(params[:event])

    respond_to do |format|
      if @event.save

DELETE FROM "events" WHERE "events"."id" = ?  [["id", 980190962]]
---
  def destroy
    @event = Event.find(params[:id])
    @event.destroy