app/controllers/maps_controller.rb

SELECT "events".* FROM "events" WHERE (title LIKE '%apple%' OR description LIKE '%apple%' OR area LIKE '%apple%' OR genre LIKE '%apple%' )
---
  def index
    @events = Event.search(params[:search])