app/controllers/maps_controller.rb

  def index
  	@maps = Map.all
---
SELECT "maps".* FROM "maps"

  def show
    @map = Map.find(params[:id])
---
SELECT "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT 1  [["id", "index"]]

  def new
    @map = Map.all
---
SELECT "maps".* FROM "maps"

  def edit
    @map = Map.find(params[:id])
---
SELECT "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT 1  [["id", "980190962"]]

  def create
    @map = Map.new(params[:map])

    respond_to do |format|
      if @map.save
---
INSERT INTO "maps" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sun, 30 Dec 2012 20:24:12 UTC +00:00], ["updated_at", Sun, 30 Dec 2012 20:24:12 UTC +00:00]]

  def update
    @map = Map.find(params[:id])
---
SELECT "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT 1  [["id", "980190962"]]

  def destroy
    @map = Map.find(params[:id])
    @map.destroy
---
SELECT "maps".* FROM "maps" WHERE "maps"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "maps" WHERE "maps"."id" = ?  [["id", 980190962]]