app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "name", "password_digest", "updated_at") VALUES (?, ?, ?, ?)
---
  def create
    @user = User.new(params[:user])
	if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def destroy
    @user = User.find(params[:id])